Autodesk.Revit.DB.ViewFamilyType.IsValidDefaultTemplate(Autodesk.Revit.DB.ElementId)
Verifies that the input can be used as a default template for this view type.
Remarks:
The id must represent a template view that is compatible with this view type, or InvalidElementId.
templateId:
Id to be validated as default template.
Returns:
True if %templateId% is valid as default template, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.ViewFamilyType.DefaultTemplateId
The default template id assigned to this view type.
Remarks:
This value will be the view template for all newly created instances of this view type.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: val is not valid as a default template id.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2013